Current/Product/Production/Gateway/GatewaySubscriptionRepositoryCA/test/RetrieveByCriteria/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:gov:hhs:fha:nhinc:common:subscription" xmlns:urn1="urn:gov:hhs:fha:nhinc:common:nhinccommon">
  <soapenv:Body>
    <urn:SubscriptionCriteria>
      <urn:SubscribeePatient>
        <urn1:SubjectIdentifier>subscribeepatientid</urn1:SubjectIdentifier>
        <urn1:AssigningAuthorityIdentifier>subscribeeassigningauthid</urn1:AssigningAuthorityIdentifier>
      </urn:SubscribeePatient>
      <urn:SubscriberPatient>
        <urn1:SubjectIdentifier>subscriberpatientid</urn1:SubjectIdentifier>
        <urn1:AssigningAuthorityIdentifier>subscriberassigningauthid</urn1:AssigningAuthorityIdentifier>
      </urn:SubscriberPatient>
      <!--Optional:-->
      <urn:Criteria>
        <!--Zero or more repetitions:-->
        <urn:Criterion>
          <urn:Key>critkey1</urn:Key>
          <urn:Value>critval1</urn:Value>
        </urn:Criterion>
      </urn:Criteria>
    </urn:SubscriptionCriteria>
  </soapenv:Body>
</soapenv:Envelope>