Current/Product/Production/Gateway/GatewaySubscriptionRepositoryCA/test/RetrieveBySubscriptionReference/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:gov:hhs:fha:nhinc:common:subscription">
  <soapenv:Body>
    <urn:RetrieveBySubscriptionReferenceRequestMessage>
      <urn:SubscriptionReference>
        <!--Optional:-->
        <urn:SubscriptionManagerEndpointAddress>submgrendpointaddress</urn:SubscriptionManagerEndpointAddress>
        <!--Optional:-->
        <urn:ReferenceParameters>
          <!--Zero or more repetitions:-->
          <urn:ReferenceParameter>
            <!--Optional:-->
            <urn:Prefix>refparamprefix</urn:Prefix>
            <urn:Namespace>refparamnamespace</urn:Namespace>
            <urn:ElementName>refparamelementname</urn:ElementName>
            <urn:Value>refparamvalue</urn:Value>
          </urn:ReferenceParameter>
        </urn:ReferenceParameters>
      </urn:SubscriptionReference>
    </urn:RetrieveBySubscriptionReferenceRequestMessage>
  </soapenv:Body>
</soapenv:Envelope>