Current/Product/Production/Gateway/GatewaySubscriptionRepositoryCA/test/StoreSubscription/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:gov:hhs:fha:nhinc:common:subscription" xmlns:urn1="urn:gov:hhs:fha:nhinc:common:nhinccommon">
  <soapenv:Body>
    <urn:SubscriptionItem>
      <!--Optional:-->
      <urn:Subscriber>
        <urn:Community>
          <urn:Id>subscribercommunityid</urn:Id>
          <urn:Name>subscribercommunity name</urn:Name>
        </urn:Community>
        <urn:NotificationConsumerEndpointAddress>notificationconsumerendpointaddress</urn:NotificationConsumerEndpointAddress>
        <urn:UserAddress>subscriberuseraddress</urn:UserAddress>
      </urn:Subscriber>
      <!--Optional:-->
      <urn:Subscribee>
        <urn:Community>
          <urn:Id>subscribeecommunityid</urn:Id>
          <urn:Name>subscribeecommunityname</urn:Name>
        </urn:Community>
        <urn:NotificationProducerEndpointAddress>notificationproducerendpointaddress</urn:NotificationProducerEndpointAddress>
        <urn:UserAddress>subscribeeuseraddress</urn:UserAddress>
      </urn:Subscribee>
      <!--Optional:-->
      <urn:SubscriptionCriteria>
        <urn:SubscribeePatient>
          <urn1:SubjectIdentifier>subscribeepatientid</urn1:SubjectIdentifier>
          <urn1:AssigningAuthorityIdentifier>subscribeeassigningauthid</urn1:AssigningAuthorityIdentifier>
        </urn:SubscribeePatient>
        <urn:SubscriberPatient>
          <urn1:SubjectIdentifier>subscriberpatientid</urn1:SubjectIdentifier>
          <urn1:AssigningAuthorityIdentifier>subscriberassigningauthid</urn1:AssigningAuthorityIdentifier>
        </urn:SubscriberPatient>
        <!--Optional:-->
        <urn:Criteria>
          <!--Zero or more repetitions:-->
          <urn:Criterion>
            <urn:Key>critkey1</urn:Key>
            <urn:Value>critval1</urn:Value>
          </urn:Criterion>
        </urn:Criteria>
        <!--Optional:-->
        <urn:TopicExpression Dialect="topicdialect">topicexpression</urn:TopicExpression>
        <!--Optional:-->
        <urn:SubscriptionPolicy>
          <!--Optional:-->
          <urn:GenericPolicyItems>
            <!--Zero or more repetitions:-->
            <urn:KeyValuePair>
              <urn:Key>policykey1</urn:Key>
              <urn:Value>policyval1</urn:Value>
            </urn:KeyValuePair>
          </urn:GenericPolicyItems>
        </urn:SubscriptionPolicy>
      </urn:SubscriptionCriteria>
      <!--Optional:-->
      <urn:SubscriptionReference>
        <!--Optional:-->
        <urn:SubscriptionManagerEndpointAddress>submgrendpointaddress</urn:SubscriptionManagerEndpointAddress>
        <!--Optional:-->
        <urn:ReferenceParameters>
          <!--Zero or more repetitions:-->
          <urn:ReferenceParameter>
            <!--Optional:-->
            <urn:Prefix>refparamprefix</urn:Prefix>
            <urn:Namespace>refparamnamespace</urn:Namespace>
            <urn:ElementName>refparamelementname</urn:ElementName>
            <urn:Value>refparamvalue</urn:Value>
          </urn:ReferenceParameter>
        </urn:ReferenceParameters>
      </urn:SubscriptionReference>
      <!--Optional:-->
      <urn:ParentSubscriptionReference>
        <!--Optional:-->
        <urn:SubscriptionManagerEndpointAddress>parentsubmgrendpointaddress</urn:SubscriptionManagerEndpointAddress>
        <!--Optional:-->
        <urn:ReferenceParameters>
          <!--Zero or more repetitions:-->
          <urn:ReferenceParameter>
            <!--Optional:-->
            <urn:Prefix>parentrefparamprefix</urn:Prefix>
            <urn:Namespace>parentrefparamnamespace</urn:Namespace>
            <urn:ElementName>parentrefparamelementname</urn:ElementName>
            <urn:Value>parentrefparamvalue</urn:Value>
          </urn:ReferenceParameter>
        </urn:ReferenceParameters>
      </urn:ParentSubscriptionReference>
    </urn:SubscriptionItem>
  </soapenv:Body>
</soapenv:Envelope>