Product/Production/Gateway/GatewaySubscriptionRepositoryCA/test/RetrieveBySubscriptionReference/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <ns14:SubscriptionItem xmlns="http://docs.oasis-open.org/wsn/t-1" xmlns:jbi="http://java.sun.com/xml/ns/jbi/wsdl-11-wrapper" xmlns:msgns="urn:gov:hhs:fha:nhinc:nhinccomponentsubscriptionrepository" xmlns:ns10="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns:ns11="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:ns12="http://www.hhs.gov/healthit/nhin/cdc" xmlns:ns13="urn:gov:hhs:fha:nhinc:common:subscriptionb2overrideforcdc" xmlns:ns14="urn:gov:hhs:fha:nhinc:common:subscription" xmlns:ns15="urn:gov:hhs:fha:nhinc:common:subscriptionb2overridefordocuments" xmlns:ns2="http://docs.oasis-open.org/wsrf/bf-2" xmlns:ns3="http://www.w3.org/2005/08/addressing" xmlns:ns4="http://docs.oasis-open.org/wsn/b-2" xmlns:ns5="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:ns6="urn:gov:hhs:fha:nhinc:common:nhinccommon" xmlns:ns7="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:ns8="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:ns9="urn:ihe:iti:xds-b:2007">
      <ns14:Subscriber>
        <ns14:Community>
          <ns14:Id>subscribercommunityid</ns14:Id>
          <ns14:Name>subscribercommunity name</ns14:Name>
        </ns14:Community>
        <ns14:NotificationConsumerEndpointAddress>notificationconsumerendpointaddress</ns14:NotificationConsumerEndpointAddress>
        <ns14:UserAddress>subscriberuseraddress</ns14:UserAddress>
      </ns14:Subscriber>
      <ns14:Subscribee>
        <ns14:Community>
          <ns14:Id>subscribeecommunityid</ns14:Id>
          <ns14:Name>subscribeecommunityname</ns14:Name>
        </ns14:Community>
        <ns14:NotificationProducerEndpointAddress>notificationproducerendpointaddress</ns14:NotificationProducerEndpointAddress>
        <ns14:UserAddress>subscribeeuseraddress</ns14:UserAddress>
      </ns14:Subscribee>
      <ns14:SubscriptionCriteria>
        <ns14:SubscribeePatient>
          <ns6:SubjectIdentifier>subscribeepatientid</ns6:SubjectIdentifier>
          <ns6:AssigningAuthorityIdentifier>subscribeeassigningauthid</ns6:AssigningAuthorityIdentifier>
        </ns14:SubscribeePatient>
        <ns14:SubscriberPatient>
          <ns6:SubjectIdentifier>subscriberpatientid</ns6:SubjectIdentifier>
          <ns6:AssigningAuthorityIdentifier>subscriberassigningauthid</ns6:AssigningAuthorityIdentifier>
        </ns14:SubscriberPatient>
        <ns14:Criteria>
          <ns14:Criterion>
            <ns14:Key>critkey1</ns14:Key>
            <ns14:Value>critval1</ns14:Value>
          </ns14:Criterion>
        </ns14:Criteria>
        <ns14:TopicExpression Dialect="topicdialect">topicexpression</ns14:TopicExpression>
        <ns14:SubscriptionPolicy>
          <ns14:GenericPolicyItems>
            <ns14:KeyValuePair>
              <ns14:Key>policykey1</ns14:Key>
              <ns14:Value>policyval1</ns14:Value>
            </ns14:KeyValuePair>
          </ns14:GenericPolicyItems>
        </ns14:SubscriptionPolicy>
      </ns14:SubscriptionCriteria>
      <ns14:SubscriptionReference>
        <ns14:SubscriptionManagerEndpointAddress>submgrendpointaddress</ns14:SubscriptionManagerEndpointAddress>
        <ns14:ReferenceParameters>
          <ns14:ReferenceParameter>
            <ns14:Prefix>refparamprefix</ns14:Prefix>
            <ns14:Namespace>refparamnamespace</ns14:Namespace>
            <ns14:ElementName>refparamelementname</ns14:ElementName>
            <ns14:Value>refparamvalue</ns14:Value>
          </ns14:ReferenceParameter>
        </ns14:ReferenceParameters>
      </ns14:SubscriptionReference>
      <ns14:ParentSubscriptionReference>
        <ns14:SubscriptionManagerEndpointAddress>parentsubmgrendpointaddress</ns14:SubscriptionManagerEndpointAddress>
        <ns14:ReferenceParameters>
          <ns14:ReferenceParameter>
            <ns14:Prefix>parentrefparamprefix</ns14:Prefix>
            <ns14:Namespace>parentrefparamnamespace</ns14:Namespace>
            <ns14:ElementName>parentrefparamelementname</ns14:ElementName>
            <ns14:Value>parentrefparamvalue</ns14:Value>
          </ns14:ReferenceParameter>
        </ns14:ReferenceParameters>
      </ns14:ParentSubscriptionReference>
    </ns14:SubscriptionItem>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
